In [3]:
import pandas as pd

In [6]:
data = pd.read_csv("olympics2024.csv")

In [ ]:
5 negara dengan jumlah medali terbanyak

In [10]:
data.head(5)

   Rank        Country Country Code  Gold  Silver  Bronze  Total
0     1  United States           US    40      44      42    126
1     2          China          CHN    40      27      24     91
2     3          Japan          JPN    20      12      13     45
3     4      Australia          AUS    18      19      16     53
4     5         France          FRA    16      26      22     64

5 negara dengan jumlah medali paling sedikit

In [9]:
data.tail(5)

    Rank    Country Country Code  Gold  Silver  Bronze  Total
86    84       Peru          PER     0       0       1      1
87    84      Qatar          QAT     0       0       1      1
88    84  Singapore          SIN     0       0       1      1
89    84   Slovakia          SVK     0       0       1      1
90    84     Zambia          ZAM     0       0       1      1